GopalSaraf/Practicals/PSDL/include/proc/pic16f19197.inc
// Register: LCDDATA29
#define LCDDATA29 LCDDATA29
LCDDATA29                                equ 01D35h
// bitfield definitions
LCDDATA29_S40C4_POSN                     equ 0000h
LCDDATA29_S40C4_POSITION                 equ 0000h
LCDDATA29_S40C4_SIZE                     equ 0001h
LCDDATA29_S40C4_LENGTH                   equ 0001h
LCDDATA29_S40C4_MASK                     equ 0001h
LCDDATA29_S41C4_POSN                     equ 0001h
LCDDATA29_S41C4_POSITION                 equ 0001h
LCDDATA29_S41C4_SIZE                     equ 0001h
LCDDATA29_S41C4_LENGTH                   equ 0001h
LCDDATA29_S41C4_MASK                     equ 0002h
LCDDATA29_S42C4_POSN                     equ 0002h
LCDDATA29_S42C4_POSITION                 equ 0002h
LCDDATA29_S42C4_SIZE                     equ 0001h
LCDDATA29_S42C4_LENGTH                   equ 0001h
LCDDATA29_S42C4_MASK                     equ 0004h
LCDDATA29_S43C4_POSN                     equ 0003h
LCDDATA29_S43C4_POSITION                 equ 0003h
LCDDATA29_S43C4_SIZE                     equ 0001h
LCDDATA29_S43C4_LENGTH                   equ 0001h
LCDDATA29_S43C4_MASK                     equ 0008h
LCDDATA29_S44C4_POSN                     equ 0004h
LCDDATA29_S44C4_POSITION                 equ 0004h
LCDDATA29_S44C4_SIZE                     equ 0001h
LCDDATA29_S44C4_LENGTH                   equ 0001h
LCDDATA29_S44C4_MASK                     equ 0010h
LCDDATA29_S45C4_POSN                     equ 0005h
LCDDATA29_S45C4_POSITION                 equ 0005h
LCDDATA29_S45C4_SIZE                     equ 0001h
LCDDATA29_S45C4_LENGTH                   equ 0001h
LCDDATA29_S45C4_MASK                     equ 0020h

// Register: LCDDATA30
#define LCDDATA30 LCDDATA30
LCDDATA30                                equ 01D36h
// bitfield definitions
LCDDATA30_S00C5_POSN                     equ 0000h
LCDDATA30_S00C5_POSITION                 equ 0000h
LCDDATA30_S00C5_SIZE                     equ 0001h
LCDDATA30_S00C5_LENGTH                   equ 0001h
LCDDATA30_S00C5_MASK                     equ 0001h
LCDDATA30_S01C5_POSN                     equ 0001h
LCDDATA30_S01C5_POSITION                 equ 0001h
LCDDATA30_S01C5_SIZE                     equ 0001h
LCDDATA30_S01C5_LENGTH                   equ 0001h
LCDDATA30_S01C5_MASK                     equ 0002h
LCDDATA30_S02C5_POSN                     equ 0002h
LCDDATA30_S02C5_POSITION                 equ 0002h
LCDDATA30_S02C5_SIZE                     equ 0001h
LCDDATA30_S02C5_LENGTH                   equ 0001h
LCDDATA30_S02C5_MASK                     equ 0004h
LCDDATA30_S03C5_POSN                     equ 0003h
LCDDATA30_S03C5_POSITION                 equ 0003h
LCDDATA30_S03C5_SIZE                     equ 0001h
LCDDATA30_S03C5_LENGTH                   equ 0001h
LCDDATA30_S03C5_MASK                     equ 0008h
LCDDATA30_S04C5_POSN                     equ 0004h
LCDDATA30_S04C5_POSITION                 equ 0004h
LCDDATA30_S04C5_SIZE                     equ 0001h
LCDDATA30_S04C5_LENGTH                   equ 0001h
LCDDATA30_S04C5_MASK                     equ 0010h
LCDDATA30_S05C5_POSN                     equ 0005h
LCDDATA30_S05C5_POSITION                 equ 0005h
LCDDATA30_S05C5_SIZE                     equ 0001h
LCDDATA30_S05C5_LENGTH                   equ 0001h
LCDDATA30_S05C5_MASK                     equ 0020h
LCDDATA30_S06C5_POSN                     equ 0006h
LCDDATA30_S06C5_POSITION                 equ 0006h
LCDDATA30_S06C5_SIZE                     equ 0001h
LCDDATA30_S06C5_LENGTH                   equ 0001h
LCDDATA30_S06C5_MASK                     equ 0040h
LCDDATA30_S07C5_POSN                     equ 0007h
LCDDATA30_S07C5_POSITION                 equ 0007h
LCDDATA30_S07C5_SIZE                     equ 0001h
LCDDATA30_S07C5_LENGTH                   equ 0001h
LCDDATA30_S07C5_MASK                     equ 0080h

// Register: LCDDATA31
#define LCDDATA31 LCDDATA31
LCDDATA31                                equ 01D37h
// bitfield definitions
LCDDATA31_S08C5_POSN                     equ 0000h
LCDDATA31_S08C5_POSITION                 equ 0000h
LCDDATA31_S08C5_SIZE                     equ 0001h
LCDDATA31_S08C5_LENGTH                   equ 0001h
LCDDATA31_S08C5_MASK                     equ 0001h
LCDDATA31_S09C5_POSN                     equ 0001h
LCDDATA31_S09C5_POSITION                 equ 0001h
LCDDATA31_S09C5_SIZE                     equ 0001h
LCDDATA31_S09C5_LENGTH                   equ 0001h
LCDDATA31_S09C5_MASK                     equ 0002h
LCDDATA31_S10C5_POSN                     equ 0002h
LCDDATA31_S10C5_POSITION                 equ 0002h
LCDDATA31_S10C5_SIZE                     equ 0001h
LCDDATA31_S10C5_LENGTH                   equ 0001h
LCDDATA31_S10C5_MASK                     equ 0004h
LCDDATA31_S11C5_POSN                     equ 0003h
LCDDATA31_S11C5_POSITION                 equ 0003h
LCDDATA31_S11C5_SIZE                     equ 0001h
LCDDATA31_S11C5_LENGTH                   equ 0001h
LCDDATA31_S11C5_MASK                     equ 0008h
LCDDATA31_S12C5_POSN                     equ 0004h
LCDDATA31_S12C5_POSITION                 equ 0004h
LCDDATA31_S12C5_SIZE                     equ 0001h
LCDDATA31_S12C5_LENGTH                   equ 0001h
LCDDATA31_S12C5_MASK                     equ 0010h
LCDDATA31_S13C5_POSN                     equ 0005h
LCDDATA31_S13C5_POSITION                 equ 0005h
LCDDATA31_S13C5_SIZE                     equ 0001h
LCDDATA31_S13C5_LENGTH                   equ 0001h
LCDDATA31_S13C5_MASK                     equ 0020h
LCDDATA31_S14C5_POSN                     equ 0006h
LCDDATA31_S14C5_POSITION                 equ 0006h
LCDDATA31_S14C5_SIZE                     equ 0001h
LCDDATA31_S14C5_LENGTH                   equ 0001h
LCDDATA31_S14C5_MASK                     equ 0040h
LCDDATA31_S15C5_POSN                     equ 0007h
LCDDATA31_S15C5_POSITION                 equ 0007h
LCDDATA31_S15C5_SIZE                     equ 0001h
LCDDATA31_S15C5_LENGTH                   equ 0001h
LCDDATA31_S15C5_MASK                     equ 0080h

// Register: LCDDATA32
#define LCDDATA32 LCDDATA32
LCDDATA32                                equ 01D38h
// bitfield definitions
LCDDATA32_S16C5_POSN                     equ 0000h
LCDDATA32_S16C5_POSITION                 equ 0000h
LCDDATA32_S16C5_SIZE                     equ 0001h
LCDDATA32_S16C5_LENGTH                   equ 0001h
LCDDATA32_S16C5_MASK                     equ 0001h
LCDDATA32_S17C5_POSN                     equ 0001h
LCDDATA32_S17C5_POSITION                 equ 0001h
LCDDATA32_S17C5_SIZE                     equ 0001h
LCDDATA32_S17C5_LENGTH                   equ 0001h
LCDDATA32_S17C5_MASK                     equ 0002h
LCDDATA32_S18C5_POSN                     equ 0002h
LCDDATA32_S18C5_POSITION                 equ 0002h
LCDDATA32_S18C5_SIZE                     equ 0001h
LCDDATA32_S18C5_LENGTH                   equ 0001h
LCDDATA32_S18C5_MASK                     equ 0004h
LCDDATA32_S19C5_POSN                     equ 0003h
LCDDATA32_S19C5_POSITION                 equ 0003h
LCDDATA32_S19C5_SIZE                     equ 0001h
LCDDATA32_S19C5_LENGTH                   equ 0001h
LCDDATA32_S19C5_MASK                     equ 0008h
LCDDATA32_S20C5_POSN                     equ 0004h
LCDDATA32_S20C5_POSITION                 equ 0004h
LCDDATA32_S20C5_SIZE                     equ 0001h
LCDDATA32_S20C5_LENGTH                   equ 0001h
LCDDATA32_S20C5_MASK                     equ 0010h
LCDDATA32_S21C5_POSN                     equ 0005h
LCDDATA32_S21C5_POSITION                 equ 0005h
LCDDATA32_S21C5_SIZE                     equ 0001h
LCDDATA32_S21C5_LENGTH                   equ 0001h
LCDDATA32_S21C5_MASK                     equ 0020h
LCDDATA32_S22C5_POSN                     equ 0006h
LCDDATA32_S22C5_POSITION                 equ 0006h
LCDDATA32_S22C5_SIZE                     equ 0001h
LCDDATA32_S22C5_LENGTH                   equ 0001h
LCDDATA32_S22C5_MASK                     equ 0040h
LCDDATA32_S23C5_POSN                     equ 0007h
LCDDATA32_S23C5_POSITION                 equ 0007h
LCDDATA32_S23C5_SIZE                     equ 0001h
LCDDATA32_S23C5_LENGTH                   equ 0001h
LCDDATA32_S23C5_MASK                     equ 0080h

// Register: LCDDATA33
#define LCDDATA33 LCDDATA33
LCDDATA33                                equ 01D39h
// bitfield definitions
LCDDATA33_S24C5_POSN                     equ 0000h
LCDDATA33_S24C5_POSITION                 equ 0000h
LCDDATA33_S24C5_SIZE                     equ 0001h
LCDDATA33_S24C5_LENGTH                   equ 0001h
LCDDATA33_S24C5_MASK                     equ 0001h
LCDDATA33_S25C5_POSN                     equ 0001h
LCDDATA33_S25C5_POSITION                 equ 0001h
LCDDATA33_S25C5_SIZE                     equ 0001h
LCDDATA33_S25C5_LENGTH                   equ 0001h
LCDDATA33_S25C5_MASK                     equ 0002h
LCDDATA33_S26C5_POSN                     equ 0002h
LCDDATA33_S26C5_POSITION                 equ 0002h
LCDDATA33_S26C5_SIZE                     equ 0001h
LCDDATA33_S26C5_LENGTH                   equ 0001h
LCDDATA33_S26C5_MASK                     equ 0004h
LCDDATA33_S27C5_POSN                     equ 0003h
LCDDATA33_S27C5_POSITION                 equ 0003h
LCDDATA33_S27C5_SIZE                     equ 0001h
LCDDATA33_S27C5_LENGTH                   equ 0001h
LCDDATA33_S27C5_MASK                     equ 0008h
LCDDATA33_S28C5_POSN                     equ 0004h
LCDDATA33_S28C5_POSITION                 equ 0004h
LCDDATA33_S28C5_SIZE                     equ 0001h
LCDDATA33_S28C5_LENGTH                   equ 0001h
LCDDATA33_S28C5_MASK                     equ 0010h
LCDDATA33_S29C5_POSN                     equ 0005h
LCDDATA33_S29C5_POSITION                 equ 0005h
LCDDATA33_S29C5_SIZE                     equ 0001h
LCDDATA33_S29C5_LENGTH                   equ 0001h
LCDDATA33_S29C5_MASK                     equ 0020h
LCDDATA33_S30C5_POSN                     equ 0006h
LCDDATA33_S30C5_POSITION                 equ 0006h
LCDDATA33_S30C5_SIZE                     equ 0001h
LCDDATA33_S30C5_LENGTH                   equ 0001h
LCDDATA33_S30C5_MASK                     equ 0040h
LCDDATA33_S31C5_POSN                     equ 0007h
LCDDATA33_S31C5_POSITION                 equ 0007h
LCDDATA33_S31C5_SIZE                     equ 0001h
LCDDATA33_S31C5_LENGTH                   equ 0001h
LCDDATA33_S31C5_MASK                     equ 0080h

