GopalSaraf/Practicals/PSDL/include/proc/pic16f19197.inc
#define RF7PPS4                          BANKMASK(RF7PPS), 4
#define RF7PPS5                          BANKMASK(RF7PPS), 5
#define RG0                              BANKMASK(PORTG), 0
#define RG0PPS0                          BANKMASK(RG0PPS), 0
#define RG0PPS1                          BANKMASK(RG0PPS), 1
#define RG0PPS2                          BANKMASK(RG0PPS), 2
#define RG0PPS3                          BANKMASK(RG0PPS), 3
#define RG0PPS4                          BANKMASK(RG0PPS), 4
#define RG0PPS5                          BANKMASK(RG0PPS), 5
#define RG1                              BANKMASK(PORTG), 1
#define RG1PPS0                          BANKMASK(RG1PPS), 0
#define RG1PPS1                          BANKMASK(RG1PPS), 1
#define RG1PPS2                          BANKMASK(RG1PPS), 2
#define RG1PPS3                          BANKMASK(RG1PPS), 3
#define RG1PPS4                          BANKMASK(RG1PPS), 4
#define RG1PPS5                          BANKMASK(RG1PPS), 5
#define RG2                              BANKMASK(PORTG), 2
#define RG2PPS0                          BANKMASK(RG2PPS), 0
#define RG2PPS1                          BANKMASK(RG2PPS), 1
#define RG2PPS2                          BANKMASK(RG2PPS), 2
#define RG2PPS3                          BANKMASK(RG2PPS), 3
#define RG2PPS4                          BANKMASK(RG2PPS), 4
#define RG2PPS5                          BANKMASK(RG2PPS), 5
#define RG3                              BANKMASK(PORTG), 3
#define RG3PPS0                          BANKMASK(RG3PPS), 0
#define RG3PPS1                          BANKMASK(RG3PPS), 1
#define RG3PPS2                          BANKMASK(RG3PPS), 2
#define RG3PPS3                          BANKMASK(RG3PPS), 3
#define RG3PPS4                          BANKMASK(RG3PPS), 4
#define RG3PPS5                          BANKMASK(RG3PPS), 5
#define RG4                              BANKMASK(PORTG), 4
#define RG4PPS0                          BANKMASK(RG4PPS), 0
#define RG4PPS1                          BANKMASK(RG4PPS), 1
#define RG4PPS2                          BANKMASK(RG4PPS), 2
#define RG4PPS3                          BANKMASK(RG4PPS), 3
#define RG4PPS4                          BANKMASK(RG4PPS), 4
#define RG4PPS5                          BANKMASK(RG4PPS), 5
#define RG5                              BANKMASK(PORTG), 5
#define RG6                              BANKMASK(PORTG), 6
#define RG6PPS0                          BANKMASK(RG6PPS), 0
#define RG6PPS1                          BANKMASK(RG6PPS), 1
#define RG6PPS2                          BANKMASK(RG6PPS), 2
#define RG6PPS3                          BANKMASK(RG6PPS), 3
#define RG6PPS4                          BANKMASK(RG6PPS), 4
#define RG6PPS5                          BANKMASK(RG6PPS), 5
#define RG7                              BANKMASK(PORTG), 7
#define RG7PPS0                          BANKMASK(RG7PPS), 0
#define RG7PPS1                          BANKMASK(RG7PPS), 1
#define RG7PPS2                          BANKMASK(RG7PPS), 2
#define RG7PPS3                          BANKMASK(RG7PPS), 3
#define RG7PPS4                          BANKMASK(RG7PPS), 4
#define RG7PPS5                          BANKMASK(RG7PPS), 5
#define RH0                              BANKMASK(PORTH), 0
#define RH0PPS0                          BANKMASK(RH0PPS), 0
#define RH0PPS1                          BANKMASK(RH0PPS), 1
#define RH0PPS2                          BANKMASK(RH0PPS), 2
#define RH0PPS3                          BANKMASK(RH0PPS), 3
#define RH0PPS4                          BANKMASK(RH0PPS), 4
#define RH0PPS5                          BANKMASK(RH0PPS), 5
#define RH1                              BANKMASK(PORTH), 1
#define RH1PPS0                          BANKMASK(RH1PPS), 0
#define RH1PPS1                          BANKMASK(RH1PPS), 1
#define RH1PPS2                          BANKMASK(RH1PPS), 2
#define RH1PPS3                          BANKMASK(RH1PPS), 3
#define RH1PPS4                          BANKMASK(RH1PPS), 4
#define RH1PPS5                          BANKMASK(RH1PPS), 5
#define RH2                              BANKMASK(PORTH), 2
#define RH2PPS0                          BANKMASK(RH2PPS), 0
#define RH2PPS1                          BANKMASK(RH2PPS), 1
#define RH2PPS2                          BANKMASK(RH2PPS), 2
#define RH2PPS3                          BANKMASK(RH2PPS), 3
#define RH2PPS4                          BANKMASK(RH2PPS), 4
#define RH2PPS5                          BANKMASK(RH2PPS), 5
#define RH3                              BANKMASK(PORTH), 3
#define RH3PPS0                          BANKMASK(RH3PPS), 0
#define RH3PPS1                          BANKMASK(RH3PPS), 1
#define RH3PPS2                          BANKMASK(RH3PPS), 2
#define RH3PPS3                          BANKMASK(RH3PPS), 3
#define RH3PPS4                          BANKMASK(RH3PPS), 4
#define RH3PPS5                          BANKMASK(RH3PPS), 5
#define ROI                              BANKMASK(CPUDOZE), 5
#define RPT0                             BANKMASK(ADRPT), 0
#define RPT1                             BANKMASK(ADRPT), 1
#define RPT2                             BANKMASK(ADRPT), 2
#define RPT3                             BANKMASK(ADRPT), 3
#define RPT4                             BANKMASK(ADRPT), 4
#define RPT5                             BANKMASK(ADRPT), 5
#define RPT6                             BANKMASK(ADRPT), 6
#define RPT7                             BANKMASK(ADRPT), 7
#define RSEN                             BANKMASK(SSP1CON2), 1
#define RSEN1                            BANKMASK(SSP1CON2), 1
#define RST                              BANKMASK(SMT1STAT), 5
#define RTCCIE                           BANKMASK(PIE8), 6
#define RTCCIF                           BANKMASK(PIR8), 6
#define RTCCLKSEL0                       BANKMASK(RTCCON), 0
#define RTCCLKSEL1                       BANKMASK(RTCCON), 1
#define RTCCMD                           BANKMASK(PMD2), 7
#define RTCEN                            BANKMASK(RTCCON), 7
#define RTCSYNC                          BANKMASK(RTCCON), 4
#define RTCWREN                          BANKMASK(RTCCON), 5
#define RW                               BANKMASK(SSP1STAT), 2
#define RW1                              BANKMASK(SSP1STAT), 2
#define RX1PPS0                          BANKMASK(RX1PPS), 0
#define RX1PPS1                          BANKMASK(RX1PPS), 1
#define RX1PPS2                          BANKMASK(RX1PPS), 2
#define RX1PPS3                          BANKMASK(RX1PPS), 3
#define RX1PPS4                          BANKMASK(RX1PPS), 4
#define RX2PPS0                          BANKMASK(RX2PPS), 0
#define RX2PPS1                          BANKMASK(RX2PPS), 1
#define RX2PPS2                          BANKMASK(RX2PPS), 2
#define RX2PPS3                          BANKMASK(RX2PPS), 3
#define RX2PPS4                          BANKMASK(RX2PPS), 4
#define R_W                              BANKMASK(SSP1STAT), 2
#define R_W1                             BANKMASK(SSP1STAT), 2
#define R_nW                             BANKMASK(SSP1STAT), 2
#define R_nW1                            BANKMASK(SSP1STAT), 2
#define S00C0                            BANKMASK(LCDDATA0), 0
#define S00C1                            BANKMASK(LCDDATA6), 0
#define S00C2                            BANKMASK(LCDDATA12), 0
#define S00C3                            BANKMASK(LCDDATA18), 0
#define S00C4                            BANKMASK(LCDDATA24), 0
#define S00C5                            BANKMASK(LCDDATA30), 0
#define S00C6                            BANKMASK(LCDDATA36), 0
#define S00C7                            BANKMASK(LCDDATA42), 0
#define S01C0                            BANKMASK(LCDDATA0), 1
#define S01C1                            BANKMASK(LCDDATA6), 1
#define S01C2                            BANKMASK(LCDDATA12), 1
#define S01C3                            BANKMASK(LCDDATA18), 1
#define S01C4                            BANKMASK(LCDDATA24), 1
#define S01C5                            BANKMASK(LCDDATA30), 1
#define S01C6                            BANKMASK(LCDDATA36), 1
#define S01C7                            BANKMASK(LCDDATA42), 1
#define S02C0                            BANKMASK(LCDDATA0), 2
#define S02C1                            BANKMASK(LCDDATA6), 2
#define S02C2                            BANKMASK(LCDDATA12), 2
#define S02C3                            BANKMASK(LCDDATA18), 2
#define S02C4                            BANKMASK(LCDDATA24), 2
#define S02C5                            BANKMASK(LCDDATA30), 2
#define S02C6                            BANKMASK(LCDDATA36), 2
#define S02C7                            BANKMASK(LCDDATA42), 2
#define S03C0                            BANKMASK(LCDDATA0), 3
#define S03C1                            BANKMASK(LCDDATA6), 3
#define S03C2                            BANKMASK(LCDDATA12), 3
#define S03C3                            BANKMASK(LCDDATA18), 3
#define S03C4                            BANKMASK(LCDDATA24), 3
#define S03C5                            BANKMASK(LCDDATA30), 3
#define S03C6                            BANKMASK(LCDDATA36), 3
#define S03C7                            BANKMASK(LCDDATA42), 3
#define S04C0                            BANKMASK(LCDDATA0), 4
#define S04C1                            BANKMASK(LCDDATA6), 4
#define S04C2                            BANKMASK(LCDDATA12), 4
#define S04C3                            BANKMASK(LCDDATA18), 4
#define S04C4                            BANKMASK(LCDDATA24), 4
#define S04C5                            BANKMASK(LCDDATA30), 4
#define S04C6                            BANKMASK(LCDDATA36), 4
#define S04C7                            BANKMASK(LCDDATA42), 4
#define S05C0                            BANKMASK(LCDDATA0), 5
#define S05C1                            BANKMASK(LCDDATA6), 5
#define S05C2                            BANKMASK(LCDDATA12), 5
#define S05C3                            BANKMASK(LCDDATA18), 5
#define S05C4                            BANKMASK(LCDDATA24), 5
#define S05C5                            BANKMASK(LCDDATA30), 5
#define S05C6                            BANKMASK(LCDDATA36), 5
#define S05C7                            BANKMASK(LCDDATA42), 5
#define S06C0                            BANKMASK(LCDDATA0), 6
#define S06C1                            BANKMASK(LCDDATA6), 6
#define S06C2                            BANKMASK(LCDDATA12), 6
#define S06C3                            BANKMASK(LCDDATA18), 6
#define S06C4                            BANKMASK(LCDDATA24), 6
#define S06C5                            BANKMASK(LCDDATA30), 6
#define S06C6                            BANKMASK(LCDDATA36), 6
#define S06C7                            BANKMASK(LCDDATA42), 6
#define S07C0                            BANKMASK(LCDDATA0), 7
#define S07C1                            BANKMASK(LCDDATA6), 7
#define S07C2                            BANKMASK(LCDDATA12), 7
#define S07C3                            BANKMASK(LCDDATA18), 7
#define S07C4                            BANKMASK(LCDDATA24), 7
#define S07C5                            BANKMASK(LCDDATA30), 7
#define S07C6                            BANKMASK(LCDDATA36), 7
#define S07C7                            BANKMASK(LCDDATA42), 7
#define S08C0                            BANKMASK(LCDDATA1), 0
#define S08C1                            BANKMASK(LCDDATA7), 0
#define S08C2                            BANKMASK(LCDDATA13), 0
#define S08C3                            BANKMASK(LCDDATA19), 0
#define S08C4                            BANKMASK(LCDDATA25), 0
#define S08C5                            BANKMASK(LCDDATA31), 0
#define S08C6                            BANKMASK(LCDDATA37), 0
#define S08C7                            BANKMASK(LCDDATA43), 0
#define S09C0                            BANKMASK(LCDDATA1), 1
#define S09C1                            BANKMASK(LCDDATA7), 1
#define S09C2                            BANKMASK(LCDDATA13), 1
#define S09C3                            BANKMASK(LCDDATA19), 1
#define S09C4                            BANKMASK(LCDDATA25), 1
#define S09C5                            BANKMASK(LCDDATA31), 1
#define S09C6                            BANKMASK(LCDDATA37), 1
#define S09C7                            BANKMASK(LCDDATA43), 1
#define S10C0                            BANKMASK(LCDDATA1), 2
#define S10C1                            BANKMASK(LCDDATA7), 2
#define S10C2                            BANKMASK(LCDDATA13), 2
#define S10C3                            BANKMASK(LCDDATA19), 2
#define S10C4                            BANKMASK(LCDDATA25), 2
#define S10C5                            BANKMASK(LCDDATA31), 2
#define S10C6                            BANKMASK(LCDDATA37), 2
#define S10C7                            BANKMASK(LCDDATA43), 2
#define S11C0                            BANKMASK(LCDDATA1), 3
#define S11C1                            BANKMASK(LCDDATA7), 3
#define S11C2                            BANKMASK(LCDDATA13), 3
#define S11C3                            BANKMASK(LCDDATA19), 3
#define S11C4                            BANKMASK(LCDDATA25), 3
#define S11C5                            BANKMASK(LCDDATA31), 3
#define S11C6                            BANKMASK(LCDDATA37), 3
#define S11C7                            BANKMASK(LCDDATA43), 3
#define S12C0                            BANKMASK(LCDDATA1), 4
#define S12C1                            BANKMASK(LCDDATA7), 4
#define S12C2                            BANKMASK(LCDDATA13), 4
#define S12C3                            BANKMASK(LCDDATA19), 4
#define S12C4                            BANKMASK(LCDDATA25), 4
#define S12C5                            BANKMASK(LCDDATA31), 4
#define S12C6                            BANKMASK(LCDDATA37), 4
#define S12C7                            BANKMASK(LCDDATA43), 4
#define S13C0                            BANKMASK(LCDDATA1), 5
#define S13C1                            BANKMASK(LCDDATA7), 5
#define S13C2                            BANKMASK(LCDDATA13), 5
#define S13C3                            BANKMASK(LCDDATA19), 5
#define S13C4                            BANKMASK(LCDDATA25), 5
#define S13C5                            BANKMASK(LCDDATA31), 5
#define S13C6                            BANKMASK(LCDDATA37), 5
#define S13C7                            BANKMASK(LCDDATA43), 5
#define S14C0                            BANKMASK(LCDDATA1), 6
#define S14C1                            BANKMASK(LCDDATA7), 6
#define S14C2                            BANKMASK(LCDDATA13), 6
#define S14C3                            BANKMASK(LCDDATA19), 6
#define S14C4                            BANKMASK(LCDDATA25), 6
#define S14C5                            BANKMASK(LCDDATA31), 6
#define S14C6                            BANKMASK(LCDDATA37), 6
#define S14C7                            BANKMASK(LCDDATA43), 6
#define S15C0                            BANKMASK(LCDDATA1), 7
#define S15C1                            BANKMASK(LCDDATA7), 7
#define S15C2                            BANKMASK(LCDDATA13), 7
#define S15C3                            BANKMASK(LCDDATA19), 7
#define S15C4                            BANKMASK(LCDDATA25), 7
#define S15C5                            BANKMASK(LCDDATA31), 7
#define S15C6                            BANKMASK(LCDDATA37), 7
#define S15C7                            BANKMASK(LCDDATA43), 7
#define S16C0                            BANKMASK(LCDDATA2), 0
#define S16C1                            BANKMASK(LCDDATA8), 0
#define S16C2                            BANKMASK(LCDDATA14), 0
#define S16C3                            BANKMASK(LCDDATA20), 0
#define S16C4                            BANKMASK(LCDDATA26), 0
#define S16C5                            BANKMASK(LCDDATA32), 0
#define S16C6                            BANKMASK(LCDDATA38), 0
#define S16C7                            BANKMASK(LCDDATA44), 0
#define S17C0                            BANKMASK(LCDDATA2), 1
#define S17C1                            BANKMASK(LCDDATA8), 1
#define S17C2                            BANKMASK(LCDDATA14), 1
#define S17C3                            BANKMASK(LCDDATA20), 1
#define S17C4                            BANKMASK(LCDDATA26), 1
#define S17C5                            BANKMASK(LCDDATA32), 1
#define S17C6                            BANKMASK(LCDDATA38), 1
#define S17C7                            BANKMASK(LCDDATA44), 1
#define S18C0                            BANKMASK(LCDDATA2), 2
#define S18C1                            BANKMASK(LCDDATA8), 2
#define S18C2                            BANKMASK(LCDDATA14), 2
#define S18C3                            BANKMASK(LCDDATA20), 2
#define S18C4                            BANKMASK(LCDDATA26), 2
#define S18C5                            BANKMASK(LCDDATA32), 2
#define S18C6                            BANKMASK(LCDDATA38), 2
#define S18C7                            BANKMASK(LCDDATA44), 2
#define S19C0                            BANKMASK(LCDDATA2), 3
#define S19C1                            BANKMASK(LCDDATA8), 3
#define S19C2                            BANKMASK(LCDDATA14), 3
#define S19C3                            BANKMASK(LCDDATA20), 3
#define S19C4                            BANKMASK(LCDDATA26), 3
#define S19C5                            BANKMASK(LCDDATA32), 3
#define S19C6                            BANKMASK(LCDDATA38), 3
#define S19C7                            BANKMASK(LCDDATA44), 3
#define S2                               BANKMASK(SSP1STAT), 3
#define S20C0                            BANKMASK(LCDDATA2), 4
#define S20C1                            BANKMASK(LCDDATA8), 4
#define S20C2                            BANKMASK(LCDDATA14), 4
#define S20C3                            BANKMASK(LCDDATA20), 4
#define S20C4                            BANKMASK(LCDDATA26), 4
#define S20C5                            BANKMASK(LCDDATA32), 4
#define S20C6                            BANKMASK(LCDDATA38), 4
#define S20C7                            BANKMASK(LCDDATA44), 4
#define S21C0                            BANKMASK(LCDDATA2), 5
#define S21C1                            BANKMASK(LCDDATA8), 5
#define S21C2                            BANKMASK(LCDDATA14), 5
#define S21C3                            BANKMASK(LCDDATA20), 5
#define S21C4                            BANKMASK(LCDDATA26), 5
#define S21C5                            BANKMASK(LCDDATA32), 5
#define S21C6                            BANKMASK(LCDDATA38), 5
#define S21C7                            BANKMASK(LCDDATA44), 5
#define S22C0                            BANKMASK(LCDDATA2), 6
#define S22C1                            BANKMASK(LCDDATA8), 6
#define S22C2                            BANKMASK(LCDDATA14), 6
#define S22C3                            BANKMASK(LCDDATA20), 6
#define S22C4                            BANKMASK(LCDDATA26), 6
#define S22C5                            BANKMASK(LCDDATA32), 6
#define S22C6                            BANKMASK(LCDDATA38), 6
#define S22C7                            BANKMASK(LCDDATA44), 6
#define S23C0                            BANKMASK(LCDDATA2), 7
#define S23C1                            BANKMASK(LCDDATA8), 7
#define S23C2                            BANKMASK(LCDDATA14), 7
#define S23C3                            BANKMASK(LCDDATA20), 7
#define S23C4                            BANKMASK(LCDDATA26), 7
#define S23C5                            BANKMASK(LCDDATA32), 7
#define S23C6                            BANKMASK(LCDDATA38), 7
#define S23C7                            BANKMASK(LCDDATA44), 7
#define S24C0                            BANKMASK(LCDDATA3), 0
#define S24C1                            BANKMASK(LCDDATA9), 0
#define S24C2                            BANKMASK(LCDDATA15), 0
#define S24C3                            BANKMASK(LCDDATA21), 0
#define S24C4                            BANKMASK(LCDDATA27), 0
#define S24C5                            BANKMASK(LCDDATA33), 0
#define S24C6                            BANKMASK(LCDDATA39), 0
#define S24C7                            BANKMASK(LCDDATA45), 0
#define S25C0                            BANKMASK(LCDDATA3), 1
#define S25C1                            BANKMASK(LCDDATA9), 1
#define S25C2                            BANKMASK(LCDDATA15), 1
#define S25C3                            BANKMASK(LCDDATA21), 1
#define S25C4                            BANKMASK(LCDDATA27), 1
#define S25C5                            BANKMASK(LCDDATA33), 1
#define S25C6                            BANKMASK(LCDDATA39), 1
#define S25C7                            BANKMASK(LCDDATA45), 1
#define S26C0                            BANKMASK(LCDDATA3), 2
#define S26C1                            BANKMASK(LCDDATA9), 2
#define S26C2                            BANKMASK(LCDDATA15), 2
#define S26C3                            BANKMASK(LCDDATA21), 2
#define S26C4                            BANKMASK(LCDDATA27), 2
#define S26C5                            BANKMASK(LCDDATA33), 2
#define S26C6                            BANKMASK(LCDDATA39), 2
#define S26C7                            BANKMASK(LCDDATA45), 2
#define S27C0                            BANKMASK(LCDDATA3), 3
#define S27C1                            BANKMASK(LCDDATA9), 3
#define S27C2                            BANKMASK(LCDDATA15), 3
#define S27C3                            BANKMASK(LCDDATA21), 3
#define S27C4                            BANKMASK(LCDDATA27), 3
#define S27C5                            BANKMASK(LCDDATA33), 3
#define S27C6                            BANKMASK(LCDDATA39), 3
#define S27C7                            BANKMASK(LCDDATA45), 3
#define S28C0                            BANKMASK(LCDDATA3), 4
#define S28C1                            BANKMASK(LCDDATA9), 4
#define S28C2                            BANKMASK(LCDDATA15), 4
#define S28C3                            BANKMASK(LCDDATA21), 4
#define S28C4                            BANKMASK(LCDDATA27), 4
#define S28C5                            BANKMASK(LCDDATA33), 4
#define S28C6                            BANKMASK(LCDDATA39), 4
#define S28C7                            BANKMASK(LCDDATA45), 4
#define S29C0                            BANKMASK(LCDDATA3), 5
#define S29C1                            BANKMASK(LCDDATA9), 5
#define S29C2                            BANKMASK(LCDDATA15), 5
#define S29C3                            BANKMASK(LCDDATA21), 5
#define S29C4                            BANKMASK(LCDDATA27), 5
#define S29C5                            BANKMASK(LCDDATA33), 5
#define S29C6                            BANKMASK(LCDDATA39), 5
#define S29C7                            BANKMASK(LCDDATA45), 5
#define S30C0                            BANKMASK(LCDDATA3), 6
#define S30C1                            BANKMASK(LCDDATA9), 6
#define S30C2                            BANKMASK(LCDDATA15), 6
#define S30C3                            BANKMASK(LCDDATA21), 6
#define S30C4                            BANKMASK(LCDDATA27), 6
#define S30C5                            BANKMASK(LCDDATA33), 6
#define S30C6                            BANKMASK(LCDDATA39), 6
#define S30C7                            BANKMASK(LCDDATA45), 6
#define S31C0                            BANKMASK(LCDDATA3), 7
#define S31C1                            BANKMASK(LCDDATA9), 7
#define S31C2                            BANKMASK(LCDDATA15), 7
#define S31C3                            BANKMASK(LCDDATA21), 7
#define S31C4                            BANKMASK(LCDDATA27), 7
#define S31C5                            BANKMASK(LCDDATA33), 7
#define S31C6                            BANKMASK(LCDDATA39), 7
#define S31C7                            BANKMASK(LCDDATA45), 7
#define S32C0                            BANKMASK(LCDDATA4), 0
#define S32C1                            BANKMASK(LCDDATA10), 0
#define S32C2                            BANKMASK(LCDDATA16), 0
#define S32C3                            BANKMASK(LCDDATA22), 0
#define S32C4                            BANKMASK(LCDDATA28), 0
#define S32C5                            BANKMASK(LCDDATA34), 0
#define S32C6                            BANKMASK(LCDDATA40), 0
#define S32C7                            BANKMASK(LCDDATA46), 0
